posts.org
#+hugo_base_dir: ./
#+hugo_section: ./posts

#+hugo_auto_set_lastmod: t

#+author: Roger Gonzalez

** How I deploy my projects to a single VPS with Gitea, NGINX and Docker :selfhosted::vps::docker::nginx::gitea::devops:
:PROPERTIES:
:EXPORT_FILE_NAME: how-i-deploy-my-projects-to-a-single-vps
:EXPORT_DATE: 2026-03-15
:ID:       d7a1b3e5-4f82-4c9a-b6d1-8e3f5a7c9d02
:END:

Hello everyone 👋

A few weeks ago, the team behind [[https://jmail.world/][Jmail]] (a Gmail-styled interface for browsing
the publicly released Epstein files) shared that they had [[https://x.com/rtwlz/status/2020957597810254052][racked up a *$46,485
bill on Vercel*]] The site had gone viral with ~450 million pageviews, and
Vercel's pricing structure turned that into a five-figure invoice. Vercel's CEO
ended up covering the bill personally, which is nice, but not exactly a
scalable solution 😅

When I saw that story, my first thought was: /this is an efficiency problem/.
Jmail is essentially a search interface on top of mostly static content. [[https://news.ycombinator.com/item?id=46963473][An SRE
on Hacker News]] mentioned they handle 200x Jmail's request load on just two
Hetzner servers. The whole thing could have been served from a moderately sized
VPS for a fraction of the cost.

That got me thinking about my own setup. I run *everything* on a single VPS: my
blog, my side projects, my git server, analytics, a wiki, a forum, a secret
sharing tool, and more. The whole thing is held together by NGINX, Gitea, some
bash scripts, and Docker. No Kubernetes, no Terraform, no CI/CD platform with a
$500/month bill. Just a cheap VPS, some config files, and a deployment flow
that's simple enough that I can fix it from my phone at the beach (I've [[/2026/02/claude-code-from-the-beach-remote-coding-setup/][written
about that before]]).

I get asked about my deployment setup more often than I expected, so I figured
I'd write it all down. Let me walk you through the whole thing.

*** The VPS
:PROPERTIES:
:ID:       a1b2c3d4-1111-4aaa-b111-111111111111
:END:

I'm running a [[https://www.hetzner.com/cloud/][Hetzner Cloud]] CPX21 in Nuremberg, Germany. Here are the specs:

| Spec    | Value        |
|---------+--------------|
| vCPUs   | 3            |
| RAM     | 4 GB         |
| Disk    | 80 GB SSD    |
| OS      | Ubuntu       |
| Price   | ~€7-8/month  |

The CPX21 is one of Hetzner's shared vCPU instances. It's cheap, reliable, and
more than enough for what I need. I'm usually sitting at around ~10% CPU and
~2GB RAM, so there's plenty of headroom.

I set up the VPS manually. No Ansible, no configuration management, just plain
old SSH and installing things by hand. I know, I know, "infrastructure as code"
and all that. But for a single server that I manage myself, the overhead of
automating the setup isn't worth it. If the server dies, I can set it up again
in a couple of hours and restore from backups.

*** What's running on it
:PROPERTIES:
:ID:       a1b2c3d4-2222-4aaa-b222-222222222222
:END:

Here's everything running on this single VPS:

**** Bare metal (directly on the server)
:PROPERTIES:
:ID:       a1b2c3d4-3333-4aaa-b333-333333333333
:END:

| Service             | Purpose                         |
|---------------------+---------------------------------|
| [[https://git.rogs.me][Gitea]]               | Self-hosted git server          |
| NGINX               | Web server / reverse proxy      |
| Certbot             | SSL/TLS certificates            |
| PHP-FPM             | For WordPress sites             |
| [[https://wiki.rogs.me][DokuWiki]]            | Personal wiki                   |
| fail2ban            | Brute force protection          |
| UFW                 | Firewall                        |
| A couple WordPress sites | Various projects           |

**** Docker
:PROPERTIES:
:ID:       a1b2c3d4-4444-4aaa-b444-444444444444
:END:

| Service             | Purpose                            |
|---------------------+------------------------------------|
| [[https://ntfy.sh][ntfy]]                | Push notifications                 |
| [[https://github.com/smallwat3r/shhh][shhh]]                | Secret sharing                     |
| [[https://searx.github.io/searx/][SearXNG]]             | Privacy-respecting search engine   |
| WireGuard           | VPN                                |
| [[https://forum.yams.media][phpBB]]               | YAMS community forum               |
| [[https://umami.is/][Umami]]               | Privacy-respecting analytics       |
| Gitea Actions runner| CI/CD runner                       |
| [[https://containrrr.dev/watchtower/][Watchtower]]          | Automatic Docker image updates     |

**** Static sites (Hugo, served by NGINX)
:PROPERTIES:
:ID:       a1b2c3d4-5555-4aaa-b555-555555555555
:END:

| Site                    | Purpose                        |
|-------------------------+--------------------------------|
| [[https://rogs.me][rogs.me]]                | This blog!                     |
| [[https://montevideo.restaurant][montevideo.restaurant]]   | Restaurant directory           |
| [[https://yams.media][yams.media]]              | YAMS documentation site        |

That's a lot of stuff for a 4GB VPS. But static sites are basically free in
terms of resources, and the Docker services are all lightweight. The heaviest
things are probably Gitea and the WordPress sites, and even those barely register.

*** The web server: NGINX
:PROPERTIES:
:ID:       a1b2c3d4-6666-4aaa-b666-666666666666
:END:

Every site and service gets its own NGINX config file in ~/etc/nginx/conf.d/~.
One file per site, nice and clean. No ~sites-available~ / ~sites-enabled~
symlink dance.

Here's what a typical config looks like for one of my Hugo sites:

#+begin_src nginx
server {
    root /var/www/rogs.me;
    index index.html;

    server_name rogs.me;

    location / {
        try_files $uri $uri/ =404;
    }

    listen 443 ssl; # managed by Certbot
    ssl_certificate /etc/letsencrypt/live/rogs.me/fullchain.pem;
    ssl_certificate_key /etc/letsencrypt/live/rogs.me/privkey.pem;
    include /etc/letsencrypt/options-ssl-nginx.conf;
    ssl_dhparam /etc/letsencrypt/ssl-dhparams.pem;
}

server {
    if ($host = rogs.me) {
        return 301 https://$host$request_uri;
    }

    server_name rogs.me;
    listen 80;
    return 404;
}
#+end_src

Nothing fancy. Serve files from ~/var/www/rogs.me~, redirect HTTP to HTTPS,
done. The SSL bits are all managed by Certbot (more on that later).

For Docker services, the config looks slightly different because NGINX acts as a
reverse proxy:

#+begin_src nginx
server {
    server_name analytics.rogs.me;

    location / {
        proxy_pass http://localhost:3000;
        proxy_set_header Host $host;
        proxy_set_header X-Real-IP $remote_addr;
        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
        proxy_set_header X-Forwarded-Proto $scheme;
    }

    listen 443 ssl; # managed by Certbot
    # ... SSL config same as above
}
#+end_src

Same pattern: one file per service, NGINX handles SSL termination, and proxies
to whatever port the Docker container exposes on localhost.

*** SSL/TLS with Let's Encrypt
:PROPERTIES:
:ID:       a1b2c3d4-7777-4aaa-b777-777777777777
:END:

All certificates come from [[https://letsencrypt.org/][Let's Encrypt]] via Certbot. I installed it with
~apt~ and used the NGINX plugin:

#+begin_src bash
sudo apt install certbot python3-certbot-nginx
sudo certbot --nginx -d rogs.me
#+end_src

Certbot modifies the NGINX config automatically to add the SSL directives
(that's why you see those ~# managed by Certbot~ comments).

Certificates auto-renew daily at 3 AM via a cron job:

#+begin_src bash
0 3 * * * certbot renew -q
#+end_src

The ~-q~ flag keeps it quiet: no output unless something goes wrong. Certbot
is smart enough to only renew certificates that are close to expiring, so
running it daily is fine.

