posts.org
*** Self-hosted git with Gitea
:PROPERTIES:
:ID:       a1b2c3d4-8888-4aaa-b888-888888888888
:END:

I use [[https://gitea.com/][Gitea]] as my primary git server. It runs bare metal on the VPS (not in
Docker) and lives at [[https://git.rogs.me][git.rogs.me]].

*Why Gitea instead of just using GitHub?* I want to own my git infrastructure.
GitHub is great for collaboration, but I like having control over where my code
lives. If GitHub goes down or decides to change their terms, my repos are safe
on my own server.

That said, I mirror everything to both GitHub and GitLab so other people can
collaborate, open issues, and submit PRs. Best of both worlds: I own the
primary, and the mirrors handle the social coding side.

**** Gitea Actions
:PROPERTIES:
:ID:       a1b2c3d4-9999-4aaa-b999-999999999999
:END:

Gitea has a built-in CI/CD system called [[https://docs.gitea.com/usage/actions/overview][Gitea Actions]] that's compatible with
GitHub Actions workflows. The runner is the official ~gitea/act_runner~ Docker
image, running on the same VPS. Pretty vanilla setup, no custom configuration.

This is the core of my deployment pipeline. Every time I push to ~master~, Gitea
Actions picks up the workflow and deploys the site.

*** Deploying Hugo sites
:PROPERTIES:
:ID:       a1b2c3d4-aaaa-4aaa-baaa-aaaaaaaaaaaa
:END:

This is where it all comes together. All three of my Hugo sites follow the exact
same deployment pattern. Here's the flow:

#+begin_src
  ┌──────────┐       push        ┌──────────┐     Gitea Actions    ┌──────────┐
  │   Local   │────────────────▶ │  Gitea   │ ────────────────────▶│  Runner  │
  │  machine  │                  │(git.rogs)│                      │ (Docker) │
  └──────────┘                   └──────────┘                      └────┬─────┘
                                                                        │
                                                            SSH into same VPS
                                                                        │
                                                                        ▼
                                                                 ┌──────────┐
                                                                 │   VPS    │
                                                                 │ git pull │
                                                                 │ build.sh │
                                                                 └────┬─────┘
                                                                      │
                                                              Hugo builds to
                                                             /var/www/domain/
                                                                      │
                                                                      ▼
                                                                 ┌──────────┐
                                                                 │  NGINX   │
                                                                 │  serves  │
                                                                 └──────────┘
#+end_src

Yes, the Gitea Actions runner SSHes into the same server it's running on. I know
that's a bit redundant, but I designed it this way on purpose: if I ever move my
hosting somewhere else (or switch back to GitHub Actions), the workflow doesn't
need to change. The SSH target is just a secret, so I swap an IP address and
everything keeps working.

**** The Gitea Actions workflow
:PROPERTIES:
:ID:       a1b2c3d4-bbbb-4aaa-bbbb-bbbbbbbbbbbb
:END:

Here's the workflow file that lives in ~.gitea/workflows/deploy.yml~ in each
repo:

#+begin_src yaml
name: deploy

on:
  push:
    branches:
      - master

jobs:
  deploy:
    runs-on: ubuntu-latest
    steps:
      - name: Deploy via SSH
        uses: appleboy/ssh-action@v1
        with:
          host: ${{ secrets.SSH_HOST }}
          username: ${{ secrets.SSH_USER }}
          key: ${{ secrets.SSH_PRIVATE_KEY }}
          port: ${{ secrets.SSH_PORT }}
          script: |
            cd repo && git stash && git pull --force origin master && ./build.sh
#+end_src

It's beautifully simple:

1. Push to ~master~ triggers the workflow
2. The runner uses [[https://github.com/appleboy/ssh-action][appleboy/ssh-action]] to SSH into the server
3. On the server: stash any local changes, pull the latest code, and run the
   build script

The ~git stash~ is there as a safety net. The WebP conversion in the build
script modifies tracked files (more on that in a second), so without the stash,
~git pull~ would complain about dirty working tree.

All four secrets (~SSH_HOST~, ~SSH_USER~, ~SSH_PRIVATE_KEY~, ~SSH_PORT~) are
configured in Gitea's repository settings. The SSH key has access to the server
but is locked down to only what the deployment needs.

**** The build script
:PROPERTIES:
:ID:       a1b2c3d4-cccc-4aaa-bcc1-cccccccccccc
:END:

Every Hugo site has a ~build.sh~ in the repo root. Here's the one for this blog:

#+begin_src bash
#!/bin/bash

# Convert all images to WebP for better performance
for file in $(git ls-files --others --cached --exclude-standard \
    | grep -v '.git' \
    | grep -E '\.(png|jpg|jpeg)$'); do
    cwebp -lossless "$file" -o "${file%.*}.webp"
done

# Update all references from png/jpg/jpeg to webp
for tracked_file in $(git ls-files --others --cached --exclude-standard \
    | grep -v '.git'); do
    sed -i 's/\.png/.webp/g' "$tracked_file"
    sed -i 's/\.jpg/.webp/g' "$tracked_file"
    sed -i 's/\.jpeg/.webp/g' "$tracked_file"
done

# Build the site
hugo -s . -d /var/www/rogs.me/ --minify --cacheDir $PWD/hugo-cache
#+end_src

Three things happen here:

1. *Image optimization*: Every PNG, JPG, and JPEG gets converted to WebP using
   ~cwebp~ (lossless mode, so no quality loss). WebP files are significantly
   smaller than their originals.
2. *Reference rewriting*: All file references get updated from ~.png~ /
   ~.jpg~ / ~.jpeg~ to ~.webp~. This is why we need ~git stash~ in the
   workflow; this step modifies tracked files.
3. *Hugo build*: Generates the static site with minification enabled and outputs
   it directly to ~/var/www/rogs.me/~. NGINX is already configured to serve from
   that directory, so the site is live immediately.

The ~--cacheDir~ flag keeps Hugo's build cache in the repo directory, which
speeds up subsequent builds.

Each site's ~build.sh~ is essentially identical, just with a different output
path (~montevideo.restaurant~, ~yams.media~, etc.).

**** Variations across sites
:PROPERTIES:
:ID:       a1b2c3d4-cccc-4aaa-bcc2-cccccccccccc
:END:

While the pattern is the same, there are small differences:

- *yams.media* has a two-job workflow: a ~test_build~ job runs Hugo in a Docker
  container first to make sure the build succeeds, and only then does the deploy
  job run. This is because the YAMS docs site has more contributors, so I want
  to catch build errors before they hit production.
- *yams.media* also uses ~--cleanDestinationDir~ and ~--gc~ flags for a cleaner
  build output.

