posts.org
*** Docker services and Watchtower
:PROPERTIES:
:ID:       a1b2c3d4-dddd-4aaa-bddd-dddddddddddd
:END:

Most of my non-static services run in Docker with ~docker-compose~. Each
service has its own directory in ~/opt/~:

#+begin_src
/opt/
├── analytics.rogs.me/    # Umami
│   └── docker-compose.yml
├── ntfy/
│   └── docker-compose.yml
├── shhh/
│   └── docker-compose.yml
├── searx/
│   └── docker-compose.yml
└── ...
#+end_src

For updates, I use [[https://containrrr.dev/watchtower/][Watchtower]]. It runs as a Docker container itself and
periodically checks if there are newer images available for my running
containers. If there are, it pulls the new image, stops the old container, and
starts a new one with the same configuration.

#+begin_src yaml
version: "3"
services:
  watchtower:
    image: containrrr/watchtower
    volumes:
      - /var/run/docker.sock:/var/run/docker.sock
    restart: unless-stopped
#+end_src

Is this a bit risky? Sure. An automatic update could break something. But in
practice, it hasn't failed me once, and the services I'm running are stable
enough that breaking changes in Docker images are rare. For a personal setup,
the convenience of never having to manually update containers is worth the small
risk.

*** Security
:PROPERTIES:
:ID:       a1b2c3d4-eeee-4aaa-beee-eeeeeeeeeeee
:END:

I'm not running a bank here, but I do take basic security seriously:

- *UFW (Uncomplicated Firewall)*: Only NGINX ports (80, 443) and SSH are open.
  Everything else is blocked.
- *fail2ban*: Watches SSH logs and bans IPs after too many failed login
  attempts. Essential if your SSH port is exposed to the internet.
- *SSH keys only*: Password authentication is disabled. If you don't have the
  key, you're not getting in.
- *Let's Encrypt everywhere*: Every site and service gets HTTPS. No exceptions.
- *Docker services on localhost*: All Docker containers bind to ~localhost~.
  They're only accessible through the NGINX reverse proxy, which handles SSL
  termination.

#+begin_src bash
# Quick UFW setup
sudo ufw default deny incoming
sudo ufw default allow outgoing
sudo ufw allow 'Nginx Full'
sudo ufw allow ssh
sudo ufw enable
#+end_src

*** DNS
:PROPERTIES:
:ID:       a1b2c3d4-eee2-4aaa-bee2-eeeeeeeeeeee
:END:

All my domains use [[https://www.cloudflare.com/][Cloudflare]] for DNS. But *only DNS* for most of them. I'm
not using Cloudflare's CDN or proxy features on my main sites. The DNS records
point directly to my VPS IP with the proxy toggle set to "DNS only" (the grey
cloud, not the orange one).

Why Cloudflare for DNS? Two reasons. First, it's free, fast, and the dashboard
is easy to use. Second, and more importantly: if something goes wrong, I can
switch to using Cloudflare's full proxy and DDoS protection *with the flick of a
button*. Just toggle the grey cloud to orange and you're behind Cloudflare's
network instantly.

I've already had to do this once. [[https://forum.yams.media][forum.yams.media]] (the YAMS community forum)
was getting DDoSed and swarmed by bots constantly. Flipping that toggle to
orange solved the problem immediately. The rest of my sites run without
Cloudflare's proxy because they don't need it, but knowing I can turn it on in
seconds gives me peace of mind.

*** Backups
:PROPERTIES:
:ID:       a1b2c3d4-ffff-4aaa-bfff-ffffffffffff
:END:

This is the part that most people skip. Don't be most people.

My backup strategy has two stages:

#+begin_src
  ┌─────────────┐   11 PM cron    ┌───────────────────┐
  │     VPS     │ ───────────────▶│ /home/backups/     │
  │  (services) │   tar + GPG     │ (encrypted .gpg)   │
  └─────────────┘                 └─────────┬─────────┘
                                            │
                                     midnight cron
                                       (SSH pull)
                                            │
                                            ▼
                                  ┌──────────────────┐
                                  │   Home Server    │
                                  │   (NAS + S3)     │
                                  └──────────────────┘
#+end_src

**** Stage 1: Backup on the VPS (11 PM)
:PROPERTIES:
:ID:       a1b2c3d4-fff1-4aaa-bff1-ffffffffffff
:END:

Every night at 11 PM, a series of cron jobs run backup scripts for each service.
Each script follows the same pattern:

#+begin_src bash
#!/bin/bash

BACKUP_DIR="/home/backups/servicename"
TARGET_DIR="/path/to/service"
DATE=$(date +%Y-%m-%d-%s)
BACKUP_FILE="$BACKUP_DIR/backup-servicename-$DATE.tar.zst"
ENCRYPTED_FILE="$BACKUP_FILE.gpg"
LOG_FILE="/var/log/backup_servicename.log"
GPG_RECIPIENT="your-email@example.com"

log_message() {
    echo "$(date +'%Y-%m-%d %H:%M:%S') - $1" | tee -a "$LOG_FILE"
}

log_message "=== Starting backup ==="

mkdir -p "$BACKUP_DIR"

# For Docker services: stop containers first
docker compose stop

# Create compressed archive
tar -caf "$BACKUP_FILE" -C "$TARGET_DIR" .

# Encrypt with GPG
gpg --encrypt --armor -r "$GPG_RECIPIENT" -o "$ENCRYPTED_FILE" "$BACKUP_FILE"
rm -f "$BACKUP_FILE"  # Remove unencrypted version

# For Docker services: restart containers
docker compose up -d

log_message "=== Backup completed ==="
#+end_src

Key points:

- *Compression*: I use ~tar.zst~ ([[https://facebook.github.io/zstd/][Zstandard]]) for compression. It's faster than
  gzip and produces smaller files.
- *Encryption*: Every backup gets GPG-encrypted before it touches the network.
  Even if someone gets access to the backup files, they're useless without my
  private key.
- *Docker services*: For services running in Docker, the script stops the
  containers before backing up to ensure data consistency, then starts them again.
  This causes a brief downtime (usually a few seconds), which is fine for
  personal services at 11 PM.
- *Database dumps*: For services with databases (like Gitea, which uses MySQL),
  the script dumps the database separately with ~mysqldump~ before creating the
  archive.
- *Logging*: Every step is logged to ~/var/log/~, so I can check if something
  went wrong.

**** Stage 2: Pull to home server (midnight)
:PROPERTIES:
:ID:       a1b2c3d4-fff2-4aaa-bff2-ffffffffffff
:END:

At midnight, my home server SSHes into the VPS and pulls all the encrypted
backup files to my local NAS. From there, they also get pushed to an S3 bucket.

This gives me the classic *3-2-1 backup strategy*: 3 copies of the data (VPS,
NAS, S3), on 2 different media types, with 1 offsite copy. If Hetzner's
datacenter burns down, I have everything locally. If my house burns down, I have
everything in S3.

*** Monitoring
:PROPERTIES:
:ID:       a1b2c3d4-0001-4aaa-b001-111111111111
:END:

I run [[https://github.com/louislam/uptime-kuma][Uptime Kuma]] on my home server to monitor all my services. It checks
every site and service periodically and sends me a notification (via ntfy,
naturally) if something goes down.

It's not fancy, but it works. I've caught a few issues before anyone else
noticed them, which is the whole point.

